app/controllers/movies_controller.rb

  def index
    @all_ratings = ['G', 'PG', 'PG-13', 'R']
    #debugger
    session[:order] = params[:order] unless params[:order].nil?
    session[:ratings] = params[:ratings] unless params[:ratings].nil?
    if (params[:order].nil? and session[:order]) or (params[:ratings].nil? and session[:ratings])
      flash.keep
      redirect_to movies_path(order: session[:order], ratings: session[:ratings])
    end
    @ratings = params[:ratings] ? params[:ratings].keys : @all_ratings
    @order = params[:order]
    @movies = Movie.find_all_by_rating(@ratings, order: @order)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date